{
  "navItems": {
    "profile": "Profile",
    "projects": "Projects",
    "resume": "Resume",
    "getInTouch": "Get in touch"
  },
  "profile": {
    "fullName": "Olga Kruglova",
    "jobTitle": "Frontend Developer",
    "title": "Profile",
    "description": {
      "line1": "I'm a front-end developer based in Poznan, Poland.",
      "line2": "I'm passionate about pixel-perfect, beautiful interfaces.",
      "line3": "{yearsAgo} years ago I decided to try myself in frontend. Today it is my passion.",
      "line4": {
        "start": "I work and collaborate with talented people to create digital products and ",
        "end": "I love what I do."
      }
    }
  },
  "projects": {
    "title": "Projects",
    "description": {
      "line1": "Here are some of the projects I’ve worked on over time, both past and present.",
      "line2": "Feel free to explore them."
    },
    "projects": {
      "pixelArt": {
        "name": "pixelArt",
        "title": "Pixel Art Maker",
        "description": "The Pixel Art Maker is a creative tool that allows users to design and create their own pixel art. Users can select colors from a palette and fill in the grid to form images, patterns, or characters. Try to draw something beautiful with this pixel art maker."
      },
      "matchingGame": {
        "name": "matchingGame",
        "title": "Matching Game",
        "description": "The Matching Game is an interactive puzzle where players test their memory by flipping over cards to find pairs. Each card features an image, and the goal is to match all the pairs as quickly as possible. The game sharpens memory, concentration, and pattern recognition skills, making it a fun and challenging activity for all ages."
      }
    }
  },
  "resume": {
    "title": "Resume",
    "previewTooltip": "Preview PDF",
    "downloadTooltip": "Download PDF",
    "jobs": [
      {
        "jobTitle": "Frontend software engineer",
        "clientLocation": "England",
        "sector": "Aerospace",
        "description": "Integrated Lifing is a platform for engines fleets monitoring. Supports engine removal planning and engineering assessment to support Red-Top and safety investigations. Supports operational readiness and planning of the aircraft",
        "years": "2022 - {thisYear}",
        "responsibilities": [
          "Utilizing Angular framework, particularly Angular 15 and above, to rewrite and optimize existing JavaScript application",
          "Creating web components using Typescript and KendoUI",
          "Implementing UI features using Angular and PrimeNG",
          "Managing dependencies and libraries within the Angular ecosystem, ensuring compatibility and optimal performance",
          "Employing testing frameworks (Jasmine, Karma) and debugging tools",
          "Code refactoring and code review",
          "Troubleshooting and resolving front-end issues",
          "Integrating third-party APIs and services when necessary",
          "Effective communication and collaboration with UX designers; reading and implementing Figma mocks"
        ],
        "tools": [
          "Angular14+",
          "Typescript",
          "RxJS",
          "D3.js",
          "KendoUI",
          "PrimeNG",
          "Bootstrap",
          "HTML5",
          "ES6",
          "SCSS",
          "Jasmine",
          "Karma"
        ]
      },
      {
        "jobTitle": "Frontend developer",
        "clientLocation": "Germany",
        "sector": "Education",
        "description": "HR tech startup with roots in both Düsseldorf and Berlin. Empowers companies in employee upskilling. Using data identifies skill gaps and personalizes the learning experience based on individual skills, status or proficiency levels. Offers customers action-oriented business simulations or serious games into platform, focusing on employee upskilling.",
        "years": "2020-2022",
        "responsibilities": [
          "Creating dynamic, single-page web applications using React and Material-UI",
          "Collaborating closely with UX designers, translating their Adobe mockups into interactive website elements",
          "Implementing responsive web design techniques to ensure optimal performance on various devices and screen resolutions (desktop, tablet, mobile)",
          "Maintaining close cooperation with the Backend team to integrate front-end and back-end functionalities",
          "Crafting comprehensive unit tests",
          "Participating in code reviews"
        ],
        "tools": ["React", "Typescript", "Material-UI", "HTML5", "Karma", "Jest"]
      },
      {
        "jobTitle": "Frontend developer",
        "clientLocation": "Poland",
        "sector": "Private Banking",
        "description": "AntiFraud Hub is a fraud prevention platform.",
        "years": "2019",
        "responsibilities": [
          "Updating the AngularJS application components to a newer version (Angular 2)",
          "Improving existing web application, enhancing its functionality and appearance",
          "Implementation of individual components"
        ],
        "tools": ["AngularJS", "Angular2", "Typescript", "HTML5", "CSS"]
      },
      {
        "jobTitle": "Frontend developer intern",
        "clientLocation": "England",
        "sector": "Aerospace",
        "description": "The project is directed to reduce engines lifecycle costs, provide rapid worldwide operational response to issues, and improve the safety and quality of high value installed infrastructures.",
        "years": "2019",
        "responsibilities": [
          "Contributed to the design and refinement of user interfaces, focusing on usability, accessibility, and aesthetics. Implemented responsive design principles to ensure compatibility across various devices and screen sizes",
          "Resolved various bugs and issues within the front-end codebase to enhance the stability and performance of the application",
          "Actively participated in team meetings, discussions. Communicated effectively with team members and stakeholders to gather requirements and provide updates",
          "Expanded knowledge and skills in front-end development technologies, frameworks, and tools. Experimented with new techniques and approaches"
        ],
        "tools": ["Angular2", "Typescript", "D3.js", "HTML5", "ES6", "SCSS"]
      }
    ]
  },
  "getInTouch": {
    "title": "Get in touch",
    "form": {
      "name": "Name",
      "email": "E-mail",
      "message": "Message",
      "submit": "Say Hello"
    }
  }
}
